import pandas as pd

# 1
# books = pd.DataFrame({
#     "Назва": ["Книга A", "Книга B", "Книга C", "Книга D", "Книга E", "Книга F"],
#     "Автор": ["Автор 1", "Автор 2", "Автор 3", "Автор 4", "Автор 5", "Автор 6"],
#     "Рік видання": [2010, 2018, 2020, 2015, 2022, 2013],
#     "Ціна": [200, 350, 500, 150, 600, 250]
# })

# print(books)

# print("Середня ціна:", books["Ціна"].mean())

# print(books[books["Рік видання"] > 2015])

# print(books.sort_values(by="Ціна"))


# 2
# orders = pd.read_csv("orders.csv")

# # Перші 10 рядків
# print(orders.head(10))

# # Кількість замовлень по клієнтах
# print(orders["Клієнт"].value_counts())

# # Мін і макс
# print("Максимум:", orders["Сума"].max())
# print("Мінімум:", orders["Сума"].min())

# # Загальна сума
# print("Загальна сума:", orders["Сума"].sum())



# 3
food = pd.DataFrame({
    "Продукт": ["Яблуко", "Банан", "М'ясо", "Рис", "Хліб", "Сир", "Риба", "Яйця", "Молоко", "Горіхи"],
    "Категорія": ["Фрукти", "Фрукти", "М'ясо", "Крупи", "Крупи", "Молочні", "М'ясо", "Молочні", "Молочні", "Горіхи"],
    "Калорії": [50, 90, 400, 350, 250, 300, 200, 150, 100, 600],
    "Білки": [0.3, 1.1, 25, 7, 8, 20, 22, 13, 3, 15]
})

print(food)

print(food[food["Калорії"] > 300])

print(food.groupby("Категорія")["Білки"].mean())

print(food.sort_values(by="Калорії", ascending=False))


# 4
# employees = pd.DataFrame({
#     "Ім'я": ["Іван", "Марія", "Петро", "Олена", "Іван", "Марія", "Петро", "Олена"],
#     "Проект": ["A", "A", "B", "B", "C", "C", "A", "B"],
#     "Години": [10, 20, 15, 25, 30, 10, 5, 10]
# })

# print(employees)

# print(employees.groupby("Ім'я")["Години"].sum())

# print(employees.groupby("Проект")["Години"].sum())

# print(employees.groupby("Ім'я")["Години"].sum().idxmax())



# 5
# tickets = pd.DataFrame({
#     "Фільм": ["A","A","A","B","B","B","C","C","C","D","D","D"],
#     "Місто": ["Київ","Львів","Одеса","Київ","Львів","Одеса","Київ","Львів","Одеса","Київ","Львів","Одеса"],
#     "Продані квитки": [100,80,90,120,70,60,200,150,140,50,40,30]
# })

# print(tickets)

# print(tickets.groupby("Фільм")["Продані квитки"].sum())

# print(tickets.groupby("Місто")["Продані квитки"].sum())

# print(tickets.groupby("Фільм")["Продані квитки"].sum().idxmax())


# 6
clients = pd.DataFrame({
    "ID": [1,2,3,4,5],
    "Ім'я": ["Іван","Марія","Петро","Олена","Андрій"],
    "Місто": ["Київ","Львів","Одеса","Харків","Дніпро"]
})

orders = pd.DataFrame({
    "ID клієнта": [1,2,1,3,5],
    "Замовлення": ["A","B","C","D","E"],
    "Вартість": [100,200,150,300,250]
})

print(clients)
print(orders)

merged = pd.merge(clients, orders, left_on="ID", right_on="ID клієнта")

result = merged.groupby("Ім'я")["Вартість"].sum().reset_index()

print(result)